Revit 2027 API
BuiltInFailures.FabricFailures.FabricAreaWrongHost Property
 Fabric Area can be placed only in Structural Floors and straight Structural Walls.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId FabricAreaWrongHost { get; }
Public Shared ReadOnly Property FabricAreaWrongHost As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ FabricAreaWrongHost {
	FailureDefinitionId^ get ();
}
static member FabricAreaWrongHost : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.FabricFailures Class
Autodesk.Revit.DB Namespace